# Bar Terminations Data End Treatment Type Id At Start Property

Source: https://www.revitapidocs.com/2026/9be25497-b12e-78f5-cf97-0e8325d6ab8d.htm

---

| Bar Terminations Data End Treatment Type Id At Start Property |
| --- |

Identifies the end treatment type at the start of bar.
 Setting this property to a valid value, will set the CrankTypeIdAtStart and HookTypeIdAtStart to ElementId.InvalidElementId.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ElementId EndTreatmentTypeIdAtStart { get; set; }
```

```
Public Property EndTreatmentTypeIdAtStart As ElementId
	Get
	Set
```

```
public:
property ElementId^ EndTreatmentTypeIdAtStart {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

```
member EndTreatmentTypeIdAtStart : ElementId with get, set
```

#### Property Value

ElementId Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: endTreatmentTypeIdAtStart doesn't represent an end treatment type. |
| ArgumentNullException | When setting this property: A non\-optional argument was null |

See Also

#### Reference

BarTerminationsData Class Autodesk.Revit.DB.Structure Namespace